Repository: fabschub/cliinstaller
Catalog: po/*.po
Languages: de

source: installer-cli - Install aptosid live cd onto harddik Usage: installer-cli -h print this help message -I [interface] select an interface to use with ssft. options are: text , dialog Default is dialog if installed -v print program version
de: installer-cli - Installiert aptosid auf die Festplatte Benutzung: installer-cli -h diese Hilfe ausgeben -I [interface] Interface für ssft wählen. Optionen sind: text , dialog Standard ist, wenn installiert, Dialog -v Programmversion ausgeben

source: Invalid argument for option -I: $OPTARG
de: Ungültiges Argument für Option -I: $OPTARG

source: Invalid option: -$OPTARG
de: Ungültige Option: -$OPTARG

source: Option -$OPTARG requires an argument.
de: Option -$OPTARG benötigt ein Argument.

source: E: You need to be root to run the script
de: E: Das Script muss mit Rootrechten ausgeführt werden

source: dialog is not installed
de: dialog ist nicht installiert

source: using text instead
de: Stattdessen wird text verwendet

source: Please install ssft
de: Bitte ssft installieren

source: E: The script seems to be running by another instance
de: E: Das Script scheint bereits in einer anderen Instanz zu laufen

source: E: Config file '${CONFIG_FILE}' exists already. Please remove it and run the script again
de: E: Die Konfigurationsdatei '${CONFIG_FILE}' existiert bereits. Bitte entfernen und Script erneut starten

source: ERROR
de: FEHLER

source: ${ERROR_LOG} might contain more information
de: ${ERROR_LOG} könnte mehr Informationen enthalten

source: Input Password
de: Passworteingabe

source: The password is too short! It needs to be at least 6 characters long Enter a $type password. Will not be echoed
de: Das Passwort ist zu kurz! Es muss mindestens 6 Zeichen lang sein $type Passwort eingeben. Es wird nicht angezeigt

source: Can not continue without a password
de: Kann nicht ohne ein Passwort fortfahren.

source: The ${type} is too short! It needs to be at least ${num} characters long Enter ${type} again.
de: ${type} ist zu kurz! Es muss mindestens ${num} Zeichen lang sein ${type} erneut eingeben. Es wird nicht angezeigt

source: Can not continue without a ${type}
de: Kann nicht ohne einen ${type} fortfahren.

source: The passwords do not match Enter a ${type} password. Will not be echoed
de: Die Passwörter stimmen nicht überein ${type} Passwort eingeben. Es wird nicht ausgegeben

source: Can not continue without a ${type} password
de: Kann nicht ohne ein ${type} Passwort fortfahren.

source: Please enter the password again. Will not be echoed
de: Bitte das Passwort nochmals eingeben. Es wird nicht angezeigt.

source: Unmount Partitions
de: Partitionen aushängen

source: Some partitions are still mounted. You need to unmount them for the installer to continue. Unmount now?
de: Einige Partitionen sind noch eingehängt. Diese müssen ausgehängt werden, um mit der Installation fortzufahren. Jetzt aushängen?

source: Could not unmount all partitions Aborting..
de: Nicht alle Partitionen konnten ausgehängt werden. Abbruch..

source: Could not unmount all partitions Aborting.. I: If you choose 'no' the configuration file will stay in ${CONFIG_FILE}!
de: Nicht alle Partitionen konnten ausgehängt werden.i I: Wenn 'nein' gewählt wird, dann bleibt die Konfiguration in ${CONFIG_FILE} erhalten!

source: Partitions unmounted successfully
de: Partitionen wurden erfolgreich ausgehängt

source: You chose not to unmount the partitions Aborting..
de: Partitionen sollen nicht ausgehängt werden Abbruch..

source: You chose not to unmount the partitions Aborting.. I: If you choose 'no' the configuration file will stay in ${CONFIG_FILE}!
de: Partitionen sollen nicht ausgehängt werden Abbruch.. I: Wenn 'nein' gewählt wird, dann bleibt die Konfiguration in ${CONFIG_FILE} erhalten!

source: Could not mount partition. Aborting
de: Partition kann nicht eingehängt werden. Abbruch

source: Check home
de: Home checken

source: Username exists
de: Benutzername existiert

source: Username already exists on the partition you selected as home Do you want to choose a new username or remove the mount point?
de: Der Benutzrname existiert bereits auf der für das Heimverzeichnis ausgewählten Partition Soll der gewählte Benutzername geändert oder der Einhängepunkt entfernt werden?

source: Cancelling..
de: Abbruch..

source: Format disk
de: Festplatte formatieren

source: Do you want to partition your hard disk?
de: Soll die Festplatte formatiert werden?

source: Please choose a partitioning program. Available programs are:
de: Programm für das Partitionieren wählen. Verfügbare Programme:

source: Please choose a disk to partition. Available disks are:
de: Festplatte zum Partitionieren wählen. Verfügbare Festplatten:

source: You have chosen not to partition your hard disk If you have not at least one partition on the disk the installer will not be able to complete the installation If you do not have a partition please abort now! Press ctrl+C to abort or ENTER to continue
de: Es soll keine Festplatte partitioniert werden. Steht nicht wenigstens eine Partition verfügbar, so wird die Installation scheitern. Ist keine Partition vorhanden, sollte jetzt abgebrochen werden! Strg+C zum Abbrechen oder ENTER zum Fortfahren drücken

source: Timezone selection
de: Zeitzonenwahl

source: Current timezone is: $initialTZ Do you want to change the timezone?
de: Aktuelle Zeitzone: $initialTZ Zeitzone ändern?

source: Keeping current timezone
de: Aktuelle Zeitzone wird beibehalten

source: Partitioning
de: Partitionierung

source: No partitions were detected by the installer. Do you want to manually set a partion?
de: Es wurde keine Partition gefunden. Soll eine Partition manuell angelegt werden?

source: Please input a root partition.
de: Bitte eine Rootpartition angeben.

source: Can not continue without root partition
de: Kann nicht ohne eine Rootpartition fortfahren

source: Can not continue without partition
de: Kann nicht ohne eine Partition fortfahren

source: Format hard disk
de: Festplatte formatieren

source: Do you want the installer to format your root partition?
de: Soll das Installationsprogramm die Rootpartition formatieren?

source: Filesystem selection
de: Dateisystemauswahl

source: Select a file system for your root partition
de: Dateisystem für die Rootpartition wählen

source: Could not set filesystem. Using ${FILESYSTEM}
de: Dateisystem kann nicht gesetzt werden. Benutze ${FILESYSTEM}

source: Install Partition
de: Installiere Partition

source: Choose a partition to install aptosid onto. Available partitions are:
de: Partition, auf der aptosid installiert werden soll, auswählen. Verfügbare Partitionen:

source: Set mount points
de: Einhängepunkte setzen

source: Do you want to set mount points for other partitions? W: The partitions need to be already formated I: The root partition is already set and you should not set it again
de: Sollen Einhängepunkte für andere Partitionen gesetzt werden? W: Die Partitionen müssen bereits formatiert sein I: Die Rootpartition wurde bereits gesetzt und muss nicht erneut gesetzt werden

source: Choose a partition to set its mount point. Available partitions are:
de: Partition wählen, um dessen Einhängepunkt zu setzen Verfügbare Partitionen:

source: Choose a mount point for ${partition}
de: Einhängepunkt für {partition} wählen

source: Invalid option
de: Ungültige Option

source: Finished setting mount points
de: Einhängepunkte wurden gesetzt

source: Check for space
de: Speicherplatz checken

source: Do you want the program NOT to check if there is enough space to install aptosid? If you don't know what this means please choose 'no'
de: Soll der Plattenspeicher NICHT nach ausreichen Speicherplatz für die Installation von aptosid gecheckt werden? Bei Unwissenheit bitte 'no' wählen

source: Swap autodetect
de: Swap automatisch erkennen

source: Do you want the installer to autodetect swap?
de: Soll Swap automatisch erkannt werden?

source: Select swap
de: Swapauswahl

source: Select the partitions you want to be used as swap by the installer
de: Partition für Swap wählen

source: You have no swap partitions. Nothing to select
de: Es ist keine Swappartition vorhanden. Nichts zur Auswahl

source: Input Real Name
de: Realer Name

source: Please enter your real name
de: Bitte realen Namen eingeben

source: Your input contains characters which are not allowed Characters which are not allowed are: ${NAME_NAME_NOT_ALLOWED_CHARS} Please enter again your real name
de: Die Eingabe enthält nicht erlaubte Zeichen Folgende Zeichen sind nicht erlaubt: ${NAME_NAME_NOT_ALLOWED_CHARS} Realen Namen bitte erneut eingeben

source: Input username
de: Benutzername

source: Please input your username
de: Bitte gewünschten Benutzernamen eingeben

source: Username contains characters which are not allowed Allowed characters are: ${USERNAME_ALLOWED_CHARS} Please enter username
de: Der Benutzername enthält nicht erlaubte Zeichen Erlaubte Zeichen sind: ${USERNAME_ALLOWED_CHARS} Bitte Benutzernamen eingeben

source: Enter a password for user '${USERNAME}'. Will not be echoed I: Do not use a minus (-) as the first character of the password, a space as the last or a backslash (\) anywhere in the password as those are currently not supported.
de: Passwort für Benutzer '${USERNAME}' eingeben. Es wird nicht angezeigt I: Es sollte kein Minus (-) als erstes Zeichen des Passworts, kein Leerzeichen als letztes oder ein Backslash (\) irgendwo im Passwort benutzt werden, da dies derzeit nicht unterstützt wird.

source: Can not continue without a user password
de: Kann nicht ohne ein Benutzerpasswort fortfahren.

source: Enter a root password. Will not be echoed I: Do not use a minus (-) as the first character of the password, a space as the last or a backslash (\) anywhere in the password as those are currently not supported.
de: Rootpasswort eingeben. Es wird nicht angezeigt. I: Es sollte kein Minus (-) als erstes Zeichen des Passworts, kein Leerzeichen als letztes oder ein Backslash (\) irgendwo Passwort benutzt werden, da dies derzeit nicht unterstützt wird.

source: Can not continue without a root password
de: Das Fortfahren ohne Rootpasswort ist nicht möglich.

source: Input hostname
de: Rechnernameneingabe

source: Please input hostname
de: Bitte Rechnernamen eingeben

source: Hostname contains characters which are not allowed! Allowed characters are: ${HOSTNAME_ALLOWED_CHARS} ${HOSTNAME_ALLOWED_CHAR_OTHERS} W: The hostname must start with a letter! Please enter hostname
de: Der Benutzername enthält nicht erlaubte Zeichen! Erlaubte Zeichen sind: ${HOSTNAME_ALLOWED_CHARS} ${HOSTNAME_ALLOWED_CHAR_OTHERS} W: Der Rechnername muss mit einem Buchstaben beginnen! Bitte Rechnernamen eingeben

source: Services
de: Dienste

source: Select the services you want to start on boot
de: Beim Systemstart zu startende Dienste wählen

source: Where do you want the boot-loader to be installed?
de: Wohin soll der Bootloader installiert werden?

source: Automount
de: Automatisch einhängen

source: Do you want the partitions to be automounted on boot?
de: Sollen die Partitionen beim Systemstart automatisch eingehängt weden?

source: Finished creating configuration file
de: Konfigurationsdatei wurde erstellt

source: Call Installer
de: Installation starten

source: Some error occured. Looking at ${ERROR_LOG} might provide you with answers
de: Es ist ein Fehler aufgetreten. ${ERROR_LOG} könnte bei der Problemlösung hilfen
